[

  {
    "arabic" : "اَ لۡحَمۡدُ لِلّٰهِ الَّذِىۡۤ اَنۡزَلَ عَلٰى عَبۡدِهِ الۡكِتٰبَ وَلَمۡ يَجۡعَلْ لَّهٗ عِوَجًا ؕ",
    "latin" : "Alhamdu lillaahil laziii anzala 'alaa 'abdihil kitaaba wa lam yaj'al lahuu 'iwajaa",
    "arabic_meaning" : "Segala puji bagi Allah yang telah menurunkan Kitab (Al-Qur'an) kepada hamba-Nya dan Dia tidak menjadikannya bengkok;"
  },
  {
    "arabic" : "قَيِّمًا لِّيُنۡذِرَ بَاۡسًا شَدِيۡدًا مِّنۡ لَّدُنۡهُ وَيُبَشِّرَ الۡمُؤۡمِنِيۡنَ الَّذِيۡنَ يَعۡمَلُوۡنَ الصّٰلِحٰتِ اَنَّ لَهُمۡ اَجۡرًا حَسَنًا",
    "latin" : "Qaiyimal liyunzira baasan shadiidam mil ladunhu wa yubashshiral mu'miniinal laziina ya'maluunas saalihaati anna lahum ajran hasanaa",
    "arabic_meaning" : "sebagai bimbingan yang lurus, untuk memperingatkan akan siksa yang sangat pedih dari sisi-Nya dan memberikan kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan bahwa mereka akan mendapat balasan yang baik"
  },
  {"arabic" : "مّٰكِثِيۡنَ فِيۡهِ اَبَدًا ۙ",
    "latin" : "Maakisiina fiihi abadaa",
    "arabic_meaning" : "mereka kekal di dalamnya untuk selama-lamanya."
  },
  {"arabic" : "وَّيُنۡذِرَ الَّذِيۡنَ قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا",
    "latin" : "Wa yunziral laziina qoolut takhazal laahu waladaa",
    "arabic_meaning" : "Dan untuk memperingatkan kepada orang yang berkata, \"Allah mengambil seorang anak.\""
  },
  {"arabic" : "مَا لَهُمۡ بِهٖ مِنۡ عِلۡمٍ وَّلَا لِاٰبَآٮِٕهِمۡ‌ؕ كَبُرَتۡ كَلِمَةً تَخۡرُجُ مِنۡ اَفۡوَاهِهِمۡ‌ؕ اِنۡ يَّقُوۡلُوۡنَ اِلَّا كَذِبًا",
    "latin" : "Maa lahum bihii min 'ilminw wa laa li aabaaa'ihim; kaburat kalimatan takhruju min afwaahihim; iny yaquuluuna illaa kazibaa",
    "arabic_meaning" : "Mereka sama sekali tidak mempunyai pengetahuan tentang hal itu, begitu pula nenek moyang mereka. Alangkah jeleknya kata-kata yang keluar dari mulut mereka; mereka hanya mengatakan (sesuatu) kebohongan belaka."
  },
  {"arabic" : "فَلَعَلَّكَ بَاخِعٌ نَّـفۡسَكَ عَلٰٓى اٰثَارِهِمۡ اِنۡ لَّمۡ يُؤۡمِنُوۡا بِهٰذَا الۡحَـدِيۡثِ اَسَفًا",
    "latin" : "Fala'allaka baakhi'un nafsaka 'alaaa aasaarihim illam yu;minuu bihaazal hadiisi asafaa",
    "arabic_meaning" : "Maka barangkali engkau (Muhammad) akan mencelakakan dirimu karena bersedih hati setelah mereka berpaling, sekiranya mereka tidak beriman kepada keterangan ini (Al-Qur'an)."
  },
  {"arabic" : "اِنَّا جَعَلۡنَا مَا عَلَى الۡاَرۡضِ زِيۡنَةً لَّهَا لِنَبۡلُوَهُمۡ اَ يُّهُمۡ اَحۡسَنُ عَمَلًا",
    "latin" : "Innaa ja'alnaa ma 'alal ardi ziinatal lahaa linabluwahum ayyuhum ahsanu 'amalaa",
    "arabic_meaning" : "Sesungguhnya Kami telah menjadikan apa yang ada di bumi sebagai perhiasan baginya, untuk Kami menguji mereka, siapakah di antaranya yang terbaik perbuatannya."
  },
  {"arabic" : "وَاِنَّا لَجٰعِلُوۡنَ مَا عَلَيۡهَا صَعِيۡدًا جُرُزًا",
    "latin" : "Wa innaa lajaa 'iluuna maa 'alaihaa sa'aiidan juruzaa",
    "arabic_meaning" : "Dan Kami benar-benar akan menjadikan (pula) apa yang di atasnya menjadi tanah yang tandus lagi kering."
  },
  {"arabic" : "اَمۡ حَسِبۡتَ اَنَّ اَصۡحٰبَ الۡـكَهۡفِ وَالرَّقِيۡمِۙ كَانُوۡا مِنۡ اٰيٰتِنَا عَجَبًا",
    "latin" : "Am hasibta anna Ashaabal Kahfi war Raqiimi kaanuu min Aayaatinaa 'ajabaa",
    "arabic_meaning" : "Apakah engkau mengira bahwa orang yang mendiami gua, dan (yang mempunyai) raqim itu, termasuk tanda-tanda (kebesaran) Kami yang menakjubkan?"
  },
  {"arabic" : "اِذۡ اَوَى الۡفِتۡيَةُ اِلَى الۡـكَهۡفِ فَقَالُوۡا رَبَّنَاۤ اٰتِنَا مِنۡ لَّدُنۡكَ رَحۡمَةً وَّهَيِّئۡ لَـنَا مِنۡ اَمۡرِنَا رَشَدًا",
    "latin" : "Iz awal fityatu ilal Kahfi faqooluu Rabbanaaa aatinaa mil ladunka rahmatanw wa haiyi' lanaa min amrinaa rashadaa",
    "arabic_meaning" : "(Ingatlah) ketika pemuda-pemuda itu berlindung ke dalam gua lalu mereka berdoa, \"Ya Tuhan kami. Berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah petunjuk yang lurus bagi kami dalam urusan kami.\""
  },
  {"arabic" : "فَضَرَبۡنَا عَلٰٓى اٰذَانِهِمۡ فِى الۡـكَهۡفِ سِنِيۡنَ عَدَدًا ۙ",
    "latin" : "Fadarabnaa 'alaaa aazaanihim fil Kahfi seniina 'adadaa",
    "arabic_meaning" : "Maka Kami tutup telinga mereka di dalam gua itu, selama beberapa tahun."
  },
  {"arabic" : "ثُمَّ بَعَثۡنٰهُمۡ لِنَعۡلَمَ اَىُّ الۡحِزۡبَيۡنِ اَحۡصٰى لِمَا لَبِثُوۡۤا اَمَدًا",
    "latin" : "Summa ba'asnaahum lina'lama ayyul hizbaini ahsaa limaa labisuuu amadaa",
    "arabic_meaning" : "Kemudian Kami bangunkan mereka, agar Kami mengetahui manakah di antara ke dua golongan itu yang lebih tepat dalam menghitung berapa lamanya mereka tinggal (dalam gua itu)."
  },
  {"arabic" : "نَحۡنُ نَقُصُّ عَلَيۡكَ نَبَاَهُمۡ بِالۡحَـقِّ‌ؕ اِنَّهُمۡ فِتۡيَةٌ اٰمَنُوۡا بِرَبِّهِمۡ وَزِدۡنٰهُمۡ هُدًى‌ۖ",
    "latin" : "Nahnu naqussu 'alaika naba ahum bilhaqq; innahum fityatun aamanuu bi Rabbihim wa zidnaahum hudaa",
    "arabic_meaning" : "Kami ceritakan kepadamu (Muhammad) kisah mereka dengan sebenarnya. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka, dan Kami tambahkan petunjuk kepada mereka."
  },
  {"arabic" : "وَّرَبَطۡنَا عَلٰى قُلُوۡبِهِمۡ اِذۡ قَامُوۡا فَقَالُوۡا رَبُّنَا رَبُّ السَّمٰوٰتِ وَالۡاَرۡضِ لَنۡ نَّدۡعُوَا۫ مِنۡ دُوۡنِهٖۤ اِلٰهًـا‌ لَّـقَدۡ قُلۡنَاۤ اِذًا شَطَطًا",
    "latin" : "Wa rabatnaa 'alaa quluu bihim iz qoomuu faqooluu Rabbunaa Rabbus samaawaati wal ardi lan nad'uwa min duunihiii ilaahal laqad qulnaaa izan shatataa",
    "arabic_meaning" : "Dan Kami teguhkan hati mereka ketika mereka berdiri lalu mereka berkata, \"Tuhan kami adalah Tuhan langit dan bumi; kami tidak menyeru tuhan selain Dia. Sungguh, kalau kami berbuat demikian, tentu kami telah mengucapkan perkataan yang sangat jauh dari kebenaran.\""
  },
  {"arabic" : "هٰٓؤُلَاۤءِ قَوۡمُنَا اتَّخَذُوۡا مِنۡ دُوۡنِهٖۤ اٰلِهَةً‌ ؕ لَوۡ لَا يَاۡتُوۡنَ عَلَيۡهِمۡ بِسُلۡطٰنٍۢ بَيِّنٍ‌ ؕ فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَـرٰى عَلَى اللّٰهِ كَذِبًا",
    "latin" : "Haaa'ulaaa'i qawmunat takhazuu min duunihiii aalihatal law laa yaatuuna 'alaihim bisultaanim baiyin; faman azlamu mimmaniftaraa 'alal laahi kazibaa",
    "arabic_meaning" : "Mereka itu kaum kami yang telah menjadikan tuhan-tuhan (untuk disembah) selain Dia. Mengapa mereka tidak mengemukakan alasan yang jelas (tentang kepercayaan mereka)? Maka siapakah yang lebih zhalim daripada orang yang mengada-adakan kebohongan terhadap Allah?"
  },
  {"arabic" : "وَاِذِ اعۡتَزَلۡـتُمُوۡهُمۡ وَمَا يَعۡبُدُوۡنَ اِلَّا اللّٰهَ فَاۡوٗۤا اِلَى الۡـكَهۡفِ يَنۡشُرۡ لَـكُمۡ رَبُّكُمۡ مِّنۡ رَّحۡمَتِهٖ وَيُهَيِّئۡ لَـكُمۡ مِّنۡ اَمۡرِكُمۡ مِّرۡفَقًا",
    "latin" : "Wa izi'tazal tumuuhum wa maa ya'buduuna illal laaha faawuuu ilal kahfi yanshur lakum Rabbukum mir rahmatihii wa yuhaiyi' lakum min amrikum mirfaqa",
    "arabic_meaning" : "Dan apabila kamu meninggalkan mereka dan apa yang mereka sembah selain Allah, maka carilah tempat berlindung ke dalam gua itu, niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu dan menyediakan sesuatu yang berguna bagimu dalam urusanmu."
  },
  {"arabic" : "وَتَرَى الشَّمۡسَ اِذَا طَلَعَتۡ تَّزٰوَرُ عَنۡ كَهۡفِهِمۡ ذَاتَ الۡيَمِيۡنِ وَاِذَا غَرَبَتۡ تَّقۡرِضُهُمۡ ذَاتَ الشِّمَالِ وَهُمۡ فِىۡ فَجۡوَةٍ مِّنۡهُ‌ ؕ ذٰ لِكَ مِنۡ اٰيٰتِ اللّٰهِ‌ ؕ مَنۡ يَّهۡدِ اللّٰهُ فَهُوَ الۡمُهۡتَدِ ‌ۚ وَمَنۡ يُّضۡلِلۡ فَلَنۡ تَجِدَ لَهٗ وَلِيًّا مُّرۡشِدًا",
    "latin" : "Wa tarash shamsa izaa tala'at tazaawaru 'an kahfihim zaatal yamiini wa izaa gharabat taqriduhum zaatash shimaali wa hum fii fajwatim minh; zaalika min Aayaatillaah; mai yahdil laahu fahuwal muhtad, wa mai yudlil falan tajida lahuu waliyyam murshidaa",
    "arabic_meaning" : "Dan engkau akan melihat matahari ketika terbit, condong dari gua mereka ke sebelah kanan, dan apabila matahari itu terbenam, menjauhi mereka ke sebelah kiri sedang mereka berada dalam tempat yang luas di dalam (gua) itu. Itulah sebagian dari tanda-tanda (kebesaran) Allah. Barangsiapa diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barangsiapa disesatkan-Nya, maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya."
  },
  {"arabic" : "وَ تَحۡسَبُهُمۡ اَيۡقَاظًا وَّهُمۡ رُقُوۡدٌ ‌‌ۖ وَنُـقَلِّبُهُمۡ ذَاتَ الۡيَمِيۡنِ وَ ذَاتَ الشِّمَالِ‌‌ ۖ وَكَلۡبُهُمۡ بَاسِطٌ ذِرَاعَيۡهِ بِالۡوَصِيۡدِ‌ ؕ لَوِ اطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارًا وَّلَمُلِئۡتَ مِنۡهُمۡ رُعۡبًا",
    "latin" : "Wa tahsabuhum ayqoozanw wa hum ruquud; wa nuqallibuhum zaatal yamiini wa zaatash shimaali wa kalbuhum baasitun ziraa'ayhi bilwasiid; lawit tala'ta 'alaihim la wallaita minhum firaaranw wa lamuli'ta minhum rubaa",
    "arabic_meaning" : "Dan engkau mengira mereka itu tidak tidur, padahal mereka tidur; dan Kami bolak-balikkan mereka ke kanan dan ke kiri, sedang anjing mereka membentangkan kedua lengannya di depan pintu gua. Dan jika kamu menyaksikan mereka tentu kamu akan berpaling melarikan (diri) dari mereka dan pasti kamu akan dipenuhi rasa takut terhadap mereka."
  },
  {"arabic" : "وَكَذٰلِكَ بَعَثۡنٰهُمۡ لِيَتَسَآءَلُوۡا بَيۡنَهُمۡ‌ ؕ قَالَ قَآٮِٕلٌ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡ ؕ قَالُوۡا لَبِثۡنَا يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ‌ ؕ قَالُوۡا رَبُّكُمۡ اَعۡلَمُ بِمَا لَبِثۡتُمۡ ؕ فَابۡعَثُوۡۤا اَحَدَكُمۡ بِوَرِقِكُمۡ هٰذِهٖۤ اِلَى الۡمَدِيۡنَةِ فَلۡيَنۡظُرۡ اَيُّهَاۤ اَزۡكٰى طَعَامًا فَلۡيَاۡتِكُمۡ بِرِزۡقٍ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ اَحَدًا",
    "latin" : "Wa kazaalika ba'asnaahum liyatasaaa'aluu bainahum; qoola qooa'ilum minhum kam labistum qooluu labisnaa yawman aw ba'da yawm; qooluu Rabbukum a'almu bimaa labistum fab'asuuu ahadakum biwariqikum haazihii ilal madiinati falyanzur ayyuhaaa azkaa ta'aaman fal",
    "arabic_meaning" : "Dan demikianlah Kami bangunkan mereka, agar di antara mereka saling bertanya. Salah seorang di antara mereka berkata, \"Sudah berapa lama kamu berada (di sini)?\" Mereka menjawab, \"Kita berada (di sini) sehari atau setengah hari.\" Berkata (yang lain lagi), \"Tuhanmu lebih mengetahui berapa lama kamu berada (di sini). Maka suruhlah salah seorang di antara kamu pergi ke kota dengan membawa uang perakmu ini, dan hendaklah dia lihat manakah makanan yang lebih baik, dan bawalah sebagian makanan itu untukmu, dan hendaklah dia berlaku lemah lembut dan jangan sekali-kali menceritakan halmu kepada siapa pun."
  },
  {"arabic" : "اِنَّهُمۡ اِنۡ يَّظۡهَرُوۡا عَلَيۡكُمۡ يَرۡجُمُوۡكُمۡ اَوۡ يُعِيۡدُوۡكُمۡ فِىۡ مِلَّتِهِمۡ وَلَنۡ تُفۡلِحُوۡۤا اِذًا اَبَدًا",
    "latin" : "Innahum iny yazharuu 'alaikum yarjumuukum aw yu'iiduukum fii millatihim wa lan tuflihuuu izan abadaa",
    "arabic_meaning" : "Sesungguhnya jika mereka dapat mengetahui tempatmu, niscaya mereka akan melempari kamu dengan batu, atau memaksamu kembali kepada agama mereka, dan jika demikian niscaya kamu tidak akan beruntung selama-lamanya.\""
  },
  {"arabic" : "وَكَذٰلِكَ اَعۡثَرۡنَا عَلَيۡهِمۡ لِيَـعۡلَمُوۡۤا اَنَّ وَعۡدَ اللّٰهِ حَقٌّ وَّاَنَّ السَّاعَةَ لَا رَيۡبَ فِيۡهَا ‌ۚ اِذۡ يَتَـنَازَعُوۡنَ بَيۡنَهُمۡ اَمۡرَهُمۡ‌ فَقَالُوۡا ابۡنُوۡا عَلَيۡهِمۡ بُنۡيَانًـا ‌ ؕ رَبُّهُمۡ اَعۡلَمُ بِهِمۡ‌ؕ قَالَ الَّذِيۡنَ غَلَبُوۡا عَلٰٓى اَمۡرِهِمۡ لَـنَـتَّخِذَنَّ عَلَيۡهِمۡ مَّسۡجِدًا",
    "latin" : "Wa kazaalika a'sarnaa 'alaihim liya'lamuuu anna wa'dal laahi haqqunw wa annas Saa'ata laa raiba fiihaa iz yatanaaza'uuna bainahum amrahum faqoolub nuu 'alaihim bunyaanaa; Rabbuhum a'lamu bihim; qoolal laziina ghalabuu 'alaaa amrihim lanat takhizanna 'alai",
    "arabic_meaning" : "Dan demikian (pula) Kami perlihatkan (manusia) dengan mereka, agar mereka tahu, bahwa janji Allah benar, dan bahwa (kedatangan) hari Kiamat tidak ada keraguan padanya. Ketika mereka berselisih tentang urusan mereka, maka mereka berkata, \"Dirikanlah sebuah bangunan di atas (gua) mereka, Tuhan mereka lebih mengetahui tentang mereka.\" Orang yang berkuasa atas urusan mereka berkata, \"Kami pasti akan mendirikan sebuah rumah ibadah di atasnya.\""
  },
  {"arabic" : "سَيَـقُوۡلُوۡنَ ثَلٰثَةٌ رَّابِعُهُمۡ كَلۡبُهُمۡ‌ۚ وَيَقُوۡلُوۡنَ خَمۡسَةٌ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمًۢا بِالۡغَيۡبِ‌ۚ وَيَقُوۡلُوۡنَ سَبۡعَةٌ وَّثَامِنُهُمۡ كَلۡبُهُمۡ‌ؕ قُلْ رَّبِّىۡۤ اَعۡلَمُ بِعِدَّتِهِمۡ مَّا يَعۡلَمُهُمۡ اِلَّا قَلِيۡلٌ فَلَا تُمَارِ فِيۡهِمۡ اِلَّا مِرَآءً ظَاهِرًا وَّلَا تَسۡتَفۡتِ فِيۡهِمۡ مِّنۡهُمۡ اَحَدًا",
    "latin" : "Sa yaquuluuna salaasatur raabi'uhum kalbuhum wa yaquuluuna khamsatun saadisuhum kalbuhum rajmam bilghaib; wa yaquuluuna sab'atunw wa saaminuhum kalbuhum; qur Rabbiii a'lamu bi'iddatihim maa ya'lamuhum illaa qaliil; falaa tumaari fiihim illaa miraaa'an zaa",
    "arabic_meaning" : "Nanti (ada orang yang akan) mengatakan, \"(Jumlah mereka) tiga (orang), yang ke empat adalah anjingnya,\" dan (yang lain) mengatakan, \"(Jumlah mereka) lima (orang), yang ke enam adalah anjingnya,\" sebagai terkaan terhadap yang gaib; dan (yang lain lagi) mengatakan, \"(Jumlah mereka) tujuh (orang), yang ke delapan adalah anjingnya.\" Katakanlah (Muhammad), \"Tuhanku lebih mengetahui jumlah mereka; tidak ada yang mengetahui (bilangan) mereka kecuali sedikit.\" Karena itu janganlah engkau (Muhammad) berbantah tentang hal mereka, kecuali perbantahan lahir saja dan jangan engkau menanyakan tentang mereka (pemuda-pemuda itu) kepada siapa pun."
  },
  {"arabic" : "وَلَا تَقُوۡلَنَّ لِشَاىۡءٍ اِنِّىۡ فَاعِلٌ ذٰ لِكَ غَدًا",
    "latin" : "Wa laa taquulanna lishai'in innii faa'ilun zaalika ghadaa",
    "arabic_meaning" : "Dan jangan sekali-kali engkau mengatakan terhadap sesuatu, \"Aku pasti melakukan itu besok pagi,\""
  },
  {"arabic" : "اِلَّاۤ اَنۡ يَّشَآءَ اللّٰهُ‌ ۚ وَاذۡكُرْ رَّبَّكَ اِذَا نَسِيۡتَ وَقُلۡ عَسٰٓى اَنۡ يَّهۡدِيَنِ رَبِّىۡ لِاَقۡرَبَ مِنۡ هٰذَا رَشَدًا",
    "latin" : "Illaaa any yashaaa'al laah; wazkur Rabbaka izaa nasiita wa qul 'asaaa any yahdiyani Rabbii li aqraba min haazaa rashadaa",
    "arabic_meaning" : "kecuali (dengan mengatakan), \"Insya Allah.\" Dan ingatlah kepada Tuhanmu apabila engkau lupa dan katakanlah, \"Mudah-mudahan Tuhanku akan memberiku petunjuk kepadaku agar aku yang lebih dekat (kebenarannya) daripada ini.\""
  },
  {"arabic" : "وَلَبِثُوۡا فِىۡ كَهۡفِهِمۡ ثَلٰثَ مِائَةٍ سِنِيۡنَ وَازۡدَادُوۡا تِسۡعًا",
    "latin" : "Wa labisuu fii kahfihim salaasa mi'atin siniina wazdaaduu tis'aa",
    "arabic_meaning" : "Dan mereka tinggal dalam gua selama tiga ratus tahun dan ditambah sembilan tahun."
  },
  {"arabic" : "قُلِ اللّٰهُ اَعۡلَمُ بِمَا لَبِثُوۡا‌ ۚ لَهٗ غَيۡبُ السَّمٰوٰتِ وَالۡاَرۡضِ‌ ؕ اَبۡصِرۡ بِهٖ وَاَسۡمِعۡ‌ ؕ مَا لَهُمۡ مِّنۡ دُوۡنِهٖ مِنۡ وَّلِىٍّ وَّلَا يُشۡرِكُ فِىۡ حُكۡمِهٖۤ اَحَدًا",
    "latin" : "Qulil laahu a'lamu bimaa labisuu lahuu ghaibus samaawaati wal ardi absir bihii wa asmi'; maa lahum min duunihii minw waliyyinw wa laa yushriku fii hukmihii ahadaa",
    "arabic_meaning" : "Katakanlah, \"Allah lebih mengetahui berapa lamanya mereka tinggal (di gua); milik-Nya semua yang tersembunyi di langit dan di bumi. Alangkah terang penglihatan-Nya dan alangkah tajam pendengaran-Nya; tidak ada seorang pelindung pun bagi mereka selain Dia; dan Dia tidak mengambil seorang pun menjadi sekutu-Nya dalam menetapkan keputusan.\""
  },
  {"arabic" : "وَاتۡلُ مَاۤ اُوۡحِىَ اِلَيۡكَ مِنۡ كِتَابِ رَبِّكَ ‌ؕ لَا مُبَدِّلَ لِكَلِمٰتِهٖ‌ ۚ وَلَنۡ تَجِدَ مِنۡ دُوۡنِهٖ مُلۡتَحَدًا",
    "latin" : "Watlu maaa uuhiya ilaika min Kitaabi Rabbika laa mubaddila li Kalimaatihii wa lan tajida min duunihii multahadaa",
    "arabic_meaning" : "Dan bacakanlah (Muhammad) apa yang diwahyukan kepadamu, yaitu Kitab Tuhanmu (Al-Qur'an). Tidak ada yang dapat mengubah kalimat-kalimat-Nya. Dan engkau tidak akan dapat menemukan tempat berlindung selain kepada-Nya."
  },
  {"arabic" : "وَاصۡبِرۡ نَـفۡسَكَ مَعَ الَّذِيۡنَ يَدۡعُوۡنَ رَبَّهُمۡ بِالۡغَدٰوةِ وَالۡعَشِىِّ يُرِيۡدُوۡنَ وَجۡهَهٗ‌ وَلَا تَعۡدُ عَيۡنٰكَ عَنۡهُمۡ‌ ۚ تُرِيۡدُ زِيۡنَةَ الۡحَيٰوةِ الدُّنۡيَا‌ ۚ وَ لَا تُطِعۡ مَنۡ اَغۡفَلۡنَا قَلۡبَهٗ عَنۡ ذِكۡرِنَا وَاتَّبَعَ هَوٰٮهُ وَكَانَ اَمۡرُهٗ فُرُطًا",
    "latin" : "Wasbir nafsaka ma'al laziina yad'uuna Rabbahum bilghadaati wal'ashiyyi yuriiduuna Wajhahuu wa laa ta'du 'aynaaka 'anhum turiidu ziinatal hayaatid dunyaa wa laa tuti' man aghfalnaa qalbahuu 'an zikrinaa wattaba'a hawaahu wa kaana amruhuu furutaa",
    "arabic_meaning" : "Dan bersabarlah engkau (Muhammad) bersama orang yang menyeru Tuhannya pada pagi dan senja hari dengan mengharap keridhaan-Nya; dan janganlah kedua matamu berpaling dari mereka (karena) mengharapkan perhiasan kehidupan dunia; dan janganlah engkau mengikuti orang yang hatinya telah Kami lalaikan dari mengingat Kami, serta menuruti keinginannya dan keadaannya sudah melewati batas."
  },
  {"arabic" : "وَقُلِ الۡحَـقُّ مِنۡ رَّبِّكُمۡ‌ ۖ فَمَنۡ شَآءَ فَلۡيُؤۡمِنۡ وَّمَنۡ شَآءَ فَلۡيَكۡفُرۡ ‌ۙاِنَّاۤ اَعۡتَدۡنَا لِلظّٰلِمِيۡنَ نَارًا ۙ اَحَاطَ بِهِمۡ سُرَادِقُهَا‌ ؕ وَاِنۡ يَّسۡتَغِيۡثُوۡا يُغَاثُوۡا بِمَآءٍ كَالۡمُهۡلِ يَشۡوِى الۡوُجُوۡهَ‌ؕ بِئۡسَ الشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا",
    "latin" : "Wa qulil haqqu mir Rabbikum faman shaaa'a falyu minw wa man shaaa'a falyakfur; innaaa a'tadnaa lizzaalimiina Naaran ahaata bihim suraadiquhaa; wa iny yastaghiisuu yaghaasuu bimaaa'in kalmuhli yashwil wujuuh' bi'sash-sharaab; wa saaa'at murtafaqoo",
    "arabic_meaning" : "Dan katakanlah (Muhammad), \"Kebenaran itu datangnya dari Tuhanmu; barangsiapa menghendaki (beriman) hendaklah dia beriman, dan barangsiapa menghendaki (kafir) biarlah dia kafir.\" Sesungguhnya Kami telah menyediakan neraka bagi orang zhalim, yang gejolaknya mengepung mereka. Jika mereka meminta pertolongan (minum), mereka akan diberi air seperti besi yang mendidih yang menghanguskan wajah. (Itulah) minuman yang paling buruk dan tempat istirahat yang paling jelek."
  },
  {"arabic" : "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اِنَّا لَا نُضِيۡعُ اَجۡرَ مَنۡ اَحۡسَنَ عَمَلًا‌",
    "latin" : "Innal laziina aamanuu wa 'amilus saalihaati innaa laa nudii'u ajra man ahsana 'amalaa",
    "arabic_meaning" : "Sungguh, mereka yang beriman dan mengerjakan kebajikan, Kami benar-benar tidak akan menyia-nyiakan pahala orang yang mengerjakan perbuatan yang baik itu."
  },
  {"arabic" : "اُولٰۤٮِٕكَ لَهُمۡ جَنّٰتُ عَدۡنٍ تَجۡرِىۡ مِنۡ تَحۡتِهِمُ الۡاَنۡهٰرُ يُحَلَّوۡنَ فِيۡهَا مِنۡ اَسَاوِرَ مِنۡ ذَهَبٍ وَّ يَلۡبَسُوۡنَ ثِيَابًا خُضۡرًا مِّنۡ سُنۡدُسٍ وَّاِسۡتَبۡرَقٍ مُّتَّكِــِٕيۡنَ فِيۡهَا عَلَى الۡاَرَآٮِٕكِ‌ؕ نِعۡمَ الثَّوَابُ ؕ وَحَسُنَتۡ مُرۡتَفَقًا",
    "latin" : "Ulaaa'ika lahum Jannaatu 'Adnin tajrii min tahtihimul anhaaru yuhallawna fiihaa min asaawira min zahabinw wa yalbasuuna siyaaban khudram min sundusinw wa istabraqim muttaki'iina fiihaa 'alal araaa'ik; ni'mas sawaab; wa hasunat murtafaqoo",
    "arabic_meaning" : "Mereka itulah yang memperoleh Surga ‘Adn, yang mengalir di bawahnya sungai-sungai; (dalam surga itu) mereka diberi hiasan gelang emas dan mereka memakai pakaian hijau dari sutera halus dan sutera tebal, sedang mereka duduk sambil bersandar di atas dipan-dipan yang indah. (Itulah) sebaik-baik pahala dan tempat istirahat yang indah."
  },
  {"arabic" : "وَاضۡرِبۡ لَهُمۡ مَّثَلًا رَّجُلَيۡنِ جَعَلۡنَا لِاَحَدِهِمَا جَنَّتَيۡنِ مِنۡ اَعۡنَابٍ وَّحَفَفۡنٰهُمَا بِنَخۡلٍ وَّجَعَلۡنَا بَيۡنَهُمَا زَرۡعًا",
    "latin" : "Wadrib lahum masalar rajulaini ja'alnaa li ahadihimaa jannataini min a'naabinw wa hafafnaahumaa binakhilinw wa ja'alnaa bainahumaa zar'aa",
    "arabic_meaning" : "Dan berikanlah (Muhammad) kepada mereka sebuah perumpamaan, dua orang laki-laki, yang seorang (yang kafir) Kami beri dua buah kebun anggur dan Kami kelilingi kedua kebun itu dengan pohon-pohon kurma dan di antara keduanya (kebun itu) Kami buatkan ladang."
  },
  {"arabic" : "كِلۡتَا الۡجَـنَّتَيۡنِ اٰتَتۡ اُكُلَهَا وَلَمۡ تَظۡلِمۡ مِّنۡهُ شَيۡــًٔـا‌ ۙ وَّفَجَّرۡنَا خِلٰـلَهُمَا نَهَرًا ۙ",
    "latin" : "Kiltal jannataini aatat ukulahaa wa lam tazlim minhu shai'anw wa fajjarnaa khi laalahumaa naharaa",
    "arabic_meaning" : "Kedua kebun itu menghasilkan buahnya, dan tidak berkurang (buahnya) sedikit pun, dan di celah-celah kedua kebun itu Kami alirkan sungai"
  },
  {"arabic" : "وَكَانَ لَهٗ ثَمَرٌ‌ ۚ فَقَالَ لِصَاحِبِهٖ وَهُوَ يُحَاوِرُهٗۤ اَنَا اَكۡثَرُ مِنۡكَ مَالًا وَّاَعَزُّ نَفَرًا",
    "latin" : "Wa kaana lahuu samarun faqoola lisaahibihii wa huwa yuhaawiruhuu ana aksaru minka maalanw wa a'azzu nafaraa",
    "arabic_meaning" : "dan dia memiliki kekayaan besar, maka dia berkata kepada kawannya (yang beriman) ketika bercakap-cakap dengan dia, \"Hartaku lebih banyak daripada hartamu dan pengikutku lebih kuat.\""
  },
  {"arabic" : "وَدَخَلَ جَنَّتَهٗ وَهُوَ ظَالِمٌ لِّنَفۡسِهٖ‌ ۚ قَالَ مَاۤ اَظُنُّ اَنۡ تَبِيۡدَ هٰذِهٖۤ اَبَدًا",
    "latin" : "Wa dakhala jannatahuu wa huwa zaalimul linafsihii qoola maaa azunnu an tabiida haazihiii abadaa",
    "arabic_meaning" : "Dan dia memasuki kebunnya dengan sikap merugikan dirinya sendiri (karena angkuh dan kafir); dia berkata, \"Aku kira kebun ini tidak akan binasa selama-lamanya"
  },
  {"arabic" : "وَّمَاۤ اَظُنُّ السَّاعَةَ قَآٮِٕمَةً  ۙ وَّلَٮِٕنۡ رُّدِدْتُّ اِلٰى رَبِّىۡ لَاَجِدَنَّ خَيۡرًا مِّنۡهَا مُنۡقَلَبًا",
    "latin" : "Wa maaa azunnus Saa'ata qooa'imatanw wa la'ir rudittu ilaa Rabbii la ajidanna khairam minhaa munqalabaa",
    "arabic_meaning" : "dan aku kira hari Kiamat itu tidak akan datang, dan sekiranya aku dikembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali yang lebih baik dari pada ini.\""
  },
  {"arabic" : "قَالَ لَهٗ صَاحِبُهٗ وَهُوَ يُحَاوِرُهٗۤ اَكَفَرۡتَ بِالَّذِىۡ خَلَقَكَ مِنۡ تُرَابٍ ثُمَّ مِنۡ نُّـطۡفَةٍ ثُمَّ سَوّٰٮكَ رَجُلًاؕ",
    "latin" : "Qoola lahuu saahibuhuu wa huwa yuhaawiruhuuu akafarta billazii khalaqaka min turaabin summa min nutfatin summa sawwaaka rajulaa",
    "arabic_meaning" : "Kawannya (yang beriman) berkata kepadanya sambil bercakap-cakap dengannya, \"Apakah engkau ingkar kepada (Tuhan) yang menciptakan engkau dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan engkau seorang laki-laki yang sempurna?"
  },
  {"arabic" : "لّٰـكِنَّا۟ هُوَ اللّٰهُ رَبِّىۡ وَلَاۤ اُشۡرِكُ بِرَبِّىۡۤ اَحَدًا",
    "latin" : "Laakinaa Huwal laahu Rabbii wa laa ushriku bi Rabbiii ahadaa",
    "arabic_meaning" : "Tetapi aku (percaya bahwa), Dialah Allah, Tuhanku, dan aku tidak mempersekutukan Tuhanku dengan sesuatu pun."
  },
  {"arabic" : "وَلَوۡلَاۤ اِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ اللّٰهُ ۙ لَا قُوَّةَ اِلَّا بِاللّٰهِ‌ ۚ اِنۡ تَرَنِ اَنَا اَقَلَّ مِنۡكَ مَالًا وَّوَلَدًا‌",
    "latin" : "Wa law laaa iz dakhalta jannataka qulta maa shaaa'al laahu laa quwwata illaa billaah; in tarani ana aqalla minka maalanw wa waladaa",
    "arabic_meaning" : "Dan mengapa ketika engkau memasuki kebunmu tidak mengucapkan \"Masya Allah, la quwwata illa billah\" (Sungguh, atas kehendak Allah, semua ini terwujud), tidak ada kekuatan kecuali dengan (pertolongan) Allah, sekalipun engkau anggap harta dan keturunanku lebih sedikit daripadamu."
  },
  {"arabic" : "فَعَسٰى رَبِّىۡۤ اَنۡ يُّؤۡتِيَنِ خَيۡرًا مِّنۡ جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانًا مِّنَ السَّمَآءِ فَتُصۡبِحَ صَعِيۡدًا زَلَـقًا ۙ",
    "latin" : "Fa'asaa Rabiii any yu'tiyani khairam min jannatika wa yursila 'alaihaa husbaanam minas samaaa'i fatusbiha sa'iidan zalaqoo",
    "arabic_meaning" : "Maka mudah-mudahan Tuhanku, akan memberikan kepadaku (kebun) yang lebih baik dari kebunmu (ini); dan Dia mengirimkan petir dari langit ke kebunmu, sehingga (kebun itu) menjadi tanah yang licin"
  },
  {"arabic" : "اَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرًا فَلَنۡ تَسۡتَطِيۡعَ لَهٗ طَلَبًا",
    "latin" : "Aw yusbiha maaa'uhaaa ghawran falan tastatii'a lahuu talabaa",
    "arabic_meaning" : "atau airnya menjadi surut ke dalam tanah, maka engkau tidak akan dapat menemukannya lagi.\""
  },
  {"arabic" : "وَاُحِيۡطَ بِثَمَرِهٖ فَاَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَاۤ اَنۡفَقَ فِيۡهَا وَهِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا وَيَقُوۡلُ يٰلَيۡتَنِىۡ لَمۡ اُشۡرِكۡ بِرَبِّىۡۤ اَحَدًا",
    "latin" : "Wa uhiita bisamarihii faasbaha yuqallibu kaffaihi 'alaa maaa anfaqa fiihaa wa hiya khaawiyatun 'alaa 'uruushihaa wa yaquulu yaalaitanii lam ushrik bi Rabbiii ahadaa",
    "arabic_meaning" : "Dan harta kekayaannya dibinasakan, lalu dia membolak-balikkan kedua telapak tangannya (tanda menyesal) terhadap apa yang telah dia belanjakan untuk itu, sedang pohon anggur roboh bersama penyangganya (para-para) lalu dia berkata, \"Betapa sekiranya dahulu aku tidak mempersekutukan Tuhanku dengan sesuatu pun.\""
  },
  {"arabic" : "وَلَمۡ تَكُنۡ لَّهٗ فِئَةٌ يَّـنۡصُرُوۡنَهٗ مِنۡ دُوۡنِ اللّٰهِ وَمَا كَانَ مُنۡتَصِرًا ؕ",
    "latin" : "Wa lam takul lahuu fi'atuny yansuruunahuu min duunil laahi wa maa kaana muntasiraa",
    "arabic_meaning" : "Dan tidak ada (lagi) baginya segolongan pun yang dapat menolongnya selain Allah; dan dia pun tidak akan dapat membela dirinya."
  },
  {"arabic" : "هُنَالِكَ الۡوَلَايَةُ لِلّٰهِ الۡحَـقِّ‌ؕ هُوَ خَيۡرٌ ثَوَابًا وَّخَيۡرٌ عُقۡبًا",
    "latin" : "Hunaalikal walaayatu lillaahil haqq; huwa khairun sawaabanw wa khairun 'uqbaa",
    "arabic_meaning" : "Di sana, pertolongan itu hanya dari Allah Yang Mahabenar. Dialah (pemberi) pahala terbaik dan (pemberi) balasan terbaik."
  },
  {"arabic" : "وَاضۡرِبۡ لَهُمۡ مَّثَلَ الۡحَيٰوةِ الدُّنۡيَا كَمَآءٍ اَنۡزَلۡنٰهُ مِنَ السَّمَآءِ فَاخۡتَلَطَ بِهٖ نَبَاتُ الۡاَرۡضِ فَاَصۡبَحَ هَشِيۡمًا تَذۡرُوۡهُ الرِّيٰحُ‌ ؕ وَكَانَ اللّٰهُ عَلٰى كُلِّ شَىۡءٍ مُّقۡتَدِرًا",
    "latin" : "Wadrib lahum masalal hayaatid dunyaa kamaaa'in anzalnaahu minas samaaa'i fakhtalata bihii nabaatul ardi fa asbaha hashiiman tazruu hur riyaah; wa kaanal laahu 'alaa kulli shai'im muqtadiraa",
    "arabic_meaning" : "Dan buatkanlah untuk mereka (manusia) perumpamaan kehidupan dunia ini, ibarat air (hujan) yang Kami turunkan dari langit, sehingga menyuburkan tumbuh-tumbuhan di bumi, kemudian (tumbuh-tumbuhan) itu menjadi kering yang diterbangkan oleh angin. Dan Allah Mahakuasa atas segala sesuatu."
  },
  {"arabic" : "اَلۡمَالُ وَ الۡبَـنُوۡنَ زِيۡنَةُ الۡحَيٰوةِ الدُّنۡيَا‌ ۚ وَالۡبٰقِيٰتُ الصّٰلِحٰتُ خَيۡرٌ عِنۡدَ رَبِّكَ ثَوَابًا وَّخَيۡرٌ اَمَلًا",
    "latin" : "Almaalu walbanuuna ziinatul hayaatid dunya wal baaqiyaatus saalihaatu khairun 'inda Rabbika sawaabanw wa khairun amalaa",
    "arabic_meaning" : "Harta dan anak-anak adalah perhiasan kehidupan dunia tetapi amal kebajikan yang terus-menerus adalah lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan."
  },
  {"arabic" : "وَيَوۡمَ نُسَيِّرُ الۡجِبَالَ و تَرَى الۡاَرۡضَ بَارِزَةً  ۙ وَّحَشَرۡنٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ اَحَدًا‌",
    "latin" : "Wa yawma nusaiyirul jibaala wa taral arda baariza tanw wa hasharnaahum falam nughaadir minhum ahadaa",
    "arabic_meaning" : "Dan (ingatlah) pada hari (ketika) Kami perjalankan gunung-gunung dan engkau akan melihat bumi itu rata dan Kami kumpulkan mereka (seluruh manusia), dan tidak Kami tinggalkan seorang pun dari mereka."
  },
  {"arabic" : "وَعُرِضُوۡا عَلٰى رَبِّكَ صَفًّا ؕ لَقَدۡ جِئۡتُمُوۡنَا كَمَا خَلَقۡنٰكُمۡ اَوَّلَ مَرَّةٍ ۢ بَلۡ زَعَمۡتُمۡ اَ لَّنۡ نَّجۡعَلَ لَـكُمۡ مَّوۡعِدًا",
    "latin" : "Wa 'uriduu 'alaa Rabbika saffaa, laqad ji'tumuunaa kamaa khalaqnaakum awala marrah; bal za'amtum allannaj'ala lakum maw'idaa",
    "arabic_meaning" : "Dan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. (Allah berfirman), \"Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada pertama kali; bahkan kamu menganggap bahwa Kami tidak akan menetapkan bagi kamu waktu (berbangkit untuk memenuhi) perjanjian.\""
  },
  {"arabic" : "وَوُضِعَ الۡكِتٰبُ فَتَرَى الۡمُجۡرِمِيۡنَ مُشۡفِقِيۡنَ مِمَّا فِيۡهِ وَ يَقُوۡلُوۡنَ يٰوَيۡلَـتَـنَا مَالِ هٰذَا الۡـكِتٰبِ لَا يُغَادِرُ صَغِيۡرَةً وَّلَا كَبِيۡرَةً اِلَّاۤ اَحۡصٰٮهَا‌ ۚ وَوَجَدُوۡا مَا عَمِلُوۡا حَاضِرًا‌ ؕ وَ لَا يَظۡلِمُ رَبُّكَ اَحَدًا",
    "latin" : "Wa wudi'al kitaabu fataral mujrimiina mushfiqiina mimmaa fiihi wa yaquuluuna yaa wailatanaa maa lihaazal kitaabi laa yughaadiru saghii ratanw wa laa kabiiratan illaaa ahsaahaa; wa wajaduu maa 'amiluu haadiraa; wa laa yazlimu Rabbuka ahadaa",
    "arabic_meaning" : "Dan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzhalimi seorang jua pun."
  },
  {"arabic" : "وَاِذۡ قُلۡنَا لِلۡمَلٰۤٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡۤا اِلَّاۤ اِبۡلِيۡسَؕ كَانَ مِنَ الۡجِنِّ فَفَسَقَ عَنۡ اَمۡرِ رَبِّهٖؕ اَفَتَـتَّخِذُوۡنَهٗ وَذُرِّيَّتَهٗۤ اَوۡلِيَآءَ مِنۡ دُوۡنِىۡ وَهُمۡ لَـكُمۡ عَدُوٌّ ؕ بِئۡسَ لِلظّٰلِمِيۡنَ بَدَلًا",
    "latin" : "Wa iz qulnaa lilma laaa'ikatis juduu li Aadama fasajaduuu illaaa Ibliisa kaana minal jinni fafasaqa 'an amri Rabbih; afatattakhizuunahuu wa zurriyatahuuu awliyaaa'a min duunii wa hum lakum 'aduww; bi'sa lizzaalimiina badalaa",
    "arabic_meaning" : "Dan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Dia adalah dari (golongan) jin, maka dia mendurhakai perintah Tuhannya. Pantaskah kamu menjadikan dia dan keturunannya sebagai pemimpin selain Aku, padahal mereka adalah musuhmu? Sangat buruklah (Iblis itu) sebagai pengganti (Allah) bagi orang yang zhalim."
  },
  {"arabic" : "مَّاۤ اَشۡهَدْتُّهُمۡ خَلۡقَ السَّمٰوٰتِ وَالۡاَرۡضِ وَلَا خَلۡقَ اَنۡفُسِهِمۡۖ وَمَا كُنۡتُ مُتَّخِذَ الۡمُضِلِّيۡنَ عَضُدًا",
    "latin" : "Maaa ash hattuhum khalqas samaawaati wal ardi wa laa khalqa anfusihim wa maa kuntu muttakizal mudilliina 'adudaa",
    "arabic_meaning" : "Aku tidak menghadirkan mereka (Iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi dan tidak (pula) penciptaan diri mereka sendiri; dan Aku tidak menjadikan orang yang menyesatkan itu sebagai penolong."
  },
  {"arabic" : "وَيَوۡمَ يَقُوۡلُ نَادُوۡا شُرَكَآءِىَ الَّذِيۡنَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيۡبُوۡا لَهُمۡ وَجَعَلۡنَا بَيۡنَهُمۡ مَّوۡبِقًا",
    "latin" : "Wa Yawma yaquulu naaduu shurakaaa'i yal laziina za'amtum fada'awhum falam yastajiibuu lahum wa ja'alnaa bainahum maw biqoo",
    "arabic_meaning" : "Dan (ingatlah) pada hari (ketika) Dia berfirman, \"Panggillah olehmu sekutu-sekutu-Ku yang kamu anggap itu.\" Mereka lalu memanggilnya, tetapi mereka (sekutu-sekutu) tidak membalas (seruan) mereka dan Kami adakan untuk mereka tempat kebinasaan (neraka)."
  },
  {"arabic" : "وَرَاَ الۡمُجۡرِمُوۡنَ النَّارَ فَظَنُّوۡۤا اَنَّهُمۡ مُّوَاقِعُوۡهَا وَ لَمۡ يَجِدُوۡا عَنۡهَا مَصۡرِفًا",
    "latin" : "Wa ra al mujrimuunan Naara fazannuuu annahum muwaaqi'uuhaa wa lam yajiduu 'anhaa masrifaa",
    "arabic_meaning" : "Dan orang yang berdosa melihat neraka, lalu mereka menduga, bahwa mereka akan jatuh ke dalamnya, dan mereka tidak menemukan tempat berpaling darinya."
  },
  {"arabic" : "وَلَقَدۡ صَرَّفۡنَا فِىۡ هٰذَا الۡقُرۡاٰنِ لِلنَّاسِ مِنۡ كُلِّ مَثَلٍ‌ ؕ وَكَانَ الۡاِنۡسَانُ اَكۡثَرَ شَىۡءٍ جَدَلًا",
    "latin" : "Wa laqad sarrafnaa fii haazal quraani linnaasi mn kulli masal; wa kaanal insaanu aksara shai'in jadalaa",
    "arabic_meaning" : "Dan sesungguhnya Kami telah menjelaskan berulang-ulang kepada manusia dalam Al-Qur'an ini dengan bermacam-macam perumpamaan. Tetapi manusia adalah memang yang paling banyak membantah."
  },
  {"arabic" : "وَمَا مَنَعَ النَّاسَ اَنۡ يُّؤۡمِنُوۡۤا اِذۡ جَآءَهُمُ الۡهُدٰى وَيَسۡتَغۡفِرُوۡا رَبَّهُمۡ اِلَّاۤ اَنۡ تَاۡتِيَهُمۡ سُنَّةُ الۡاَوَّلِيۡنَ اَوۡ يَاۡتِيَهُمُ الۡعَذَابُ قُبُلًا",
    "latin" : "Wa maa mana'an naasa any yu'minuuu iz jaaa'ahumul hudaa wa yastaghfiruu Rabbahum illaaa an taatiyahum sunnatul awwaliina aw yaatiyahumul 'azaabu qubulaa",
    "arabic_meaning" : "Dan tidak ada (sesuatu pun) yang menghalangi manusia untuk beriman ketika petunjuk telah datang kepada mereka dan memohon ampunan kepada Tuhannya, kecuali (keinginan menanti) datangnya hukum (Allah yang telah berlaku pada) umat yang terdahulu atau datangnya azab atas mereka dengan nyata."
  },
  {"arabic" : "وَمَا نُرۡسِلُ الۡمُرۡسَلِيۡنَ اِلَّا مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ‌ ۚ وَيُجَادِلُ الَّذِيۡنَ كَفَرُوۡا بِالۡبَاطِلِ لِـيُدۡحِضُوۡا بِهِ الۡحَـقَّ‌ وَاتَّخَذُوۡۤا اٰيٰتِىۡ وَمَاۤ اُنۡذِرُوۡا هُزُوًا",
    "latin" : "Wa maa nursilul mursaliina illaa mubashshiriina wa munziriin; wa yujaadilul laziina kafaruu bilbaatili liyudhiduu bihil haqqa wattakhazuuu Aayaatii wa maaa unziruu huzuwaa",
    "arabic_meaning" : "Dan Kami tidak mengutus rasul-rasul melainkan sebagai pembawa kabar gembira dan pemberi peringatan; tetapi orang yang kafir membantah dengan (cara) yang batil agar dengan demikian mereka dapat melenyapkan yang hak (kebenaran), dan mereka menjadikan ayat-ayat-Ku dan apa yang diperingatkan terhadap mereka sebagai olok-olokan."
  },
  {"arabic" : "وَمَنۡ اَظۡلَمُ مِمَّنۡ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ فَاَعۡرَضَ عَنۡهَا وَنَسِىَ مَا قَدَّمَتۡ يَدٰهُ‌ ؕ اِنَّا جَعَلۡنَا عَلٰى قُلُوۡبِهِمۡ اَكِنَّةً اَنۡ يَّفۡقَهُوۡهُ وَفِىۡۤ اٰذَانِهِمۡ وَقۡرًا‌ ؕ وَاِنۡ تَدۡعُهُمۡ اِلَى الۡهُدٰى فَلَنۡ يَّهۡتَدُوۡۤا اِذًا اَبَدًا",
    "latin" : "Wa man azlamu mimman zukkira bi ayaati Rabbihii fa-a'rada 'anhaa wa nasiya maa qaddamat yadaah; innaa ja'alnaa 'alaa quluubihim akinnatan any yafqahuuhu wa fiii aazaanihim waqraa; wa in tad'uhum ilal hudaa falany yahtaduuu izan abadaa",
    "arabic_meaning" : "Dan siapakah yang lebih zhalim dari pada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, lalu dia berpaling darinya dan melupakan apa yang telah dikerjakan oleh kedua tangannya? Sungguh, Kami telah menjadikan hati mereka tertutup, (sehingga mereka tidak) memahaminya, dan (Kami letakkan pula) sumbatan di telinga mereka. Kendatipun engkau (Muhammad) menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk untuk selama-lamanya."
  },
  {"arabic" : "وَرَبُّكَ الۡغَفُوۡرُ ذُوۡ الرَّحۡمَةِ‌ ؕ لَوۡ يُؤَاخِذُهُمۡ بِمَا كَسَبُوۡا لَعَجَّلَ لَهُمُ الۡعَذَابَ‌ ؕ بَلْ لَّهُمۡ مَّوۡعِدٌ لَّنۡ يَّجِدُوۡا مِنۡ دُوۡنِهٖ مَوۡٮِٕلًا",
    "latin" : "Wa Rabbukal Ghafuuru zur rahmati law yu'aakhi zuhum bimaa kasabuu la'ajala lahumul 'azaab; bal lahum maw'idul lany yajiduu min duunihii maw'ilaa",
    "arabic_meaning" : "Dan Tuhanmu Maha Pengampun, memiliki kasih sayang. Jika Dia hendak menyiksa mereka karena perbuatan mereka, tentu Dia akan menyegerakan siksa bagi mereka. Tetapi bagi mereka ada waktu tertentu (untuk mendapat siksa) yang mereka tidak akan menemukan tempat berlindung dari-Nya."
  },
  {"arabic" : "وَتِلۡكَ الۡقُرٰٓى اَهۡلَكۡنٰهُمۡ لَمَّا ظَلَمُوۡا وَجَعَلۡنَا لِمَهۡلِكِهِمۡ مَّوۡعِدًا",
    "latin" : "Wa tkal quraaa ahlak nahum lammaa zulamuu wa ja'alnaa limahlikihim maw'idaa",
    "arabic_meaning" : "Dan (penduduk) negeri itu telah Kami binasakan ketika mereka berbuat zhalim, dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka."
  },
  {"arabic" : "وَاِذۡ قَالَ مُوۡسٰى لِفَتٰٮهُ لَاۤ اَبۡرَحُ حَتّٰۤى اَبۡلُغَ مَجۡمَعَ الۡبَحۡرَيۡنِ اَوۡ اَمۡضِىَ حُقُبًا",
    "latin" : "Wa iz qoolaa Muusaa lifataahu laaa abrahu hattaaa ablugha majma'al bahrayni aw amdiya huqubaa",
    "arabic_meaning" : "Dan (ingatlah) ketika Musa berkata kepada pembantunya, \"Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua laut; atau aku akan berjalan (terus sampai) bertahun-tahun.\""
  },
  {"arabic" : "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوۡتَهُمَا فَاتَّخَذَ سَبِيۡلَهٗ فِى الۡبَحۡرِ سَرَبًا",
    "latin" : "Falammaa balaghaa majma'a bainihimaa nasiyaa huutahumaa fattakhaza sabiilahuu fil bahri sarabaa",
    "arabic_meaning" : "Maka ketika mereka sampai ke pertemuan dua laut itu, mereka lupa ikannya, lalu (ikan) itu melompat mengambil jalannya ke laut itu."
  },
  {"arabic" : "فَلَمَّا جَاوَزَا قَالَ لِفَتٰٮهُ اٰتِنَا غَدَآءَنَا لَقَدۡ لَقِيۡنَا مِنۡ سَفَرِنَا هٰذَا نَصَبًا",
    "latin" : "Falammaa jaawazaa qoola lifataahu aatinaa ghadaaa'anaa laqad laqiina min safarinaa haazaa nasabaa",
    "arabic_meaning" : "Maka ketika mereka telah melewati (tempat itu), Musa berkata kepada pembantunya, \"Bawalah kemari makanan kita; sungguh kita telah merasa letih karena perjalanan kita ini.\""
  },
  {"arabic" : "قَالَ اَرَءَيۡتَ اِذۡ اَوَيۡنَاۤ اِلَى الصَّخۡرَةِ فَاِنِّىۡ نَسِيۡتُ الۡحُوۡتَ وَ مَاۤ اَنۡسٰٮنِيۡهُ اِلَّا الشَّيۡطٰنُ اَنۡ اَذۡكُرَهٗ‌ ‌ۚ وَاتَّخَذَ سَبِيۡلَهٗ فِىۡ الۡبَحۡر‌ِ ‌ۖعَجَبًا",
    "latin" : "Qoola ara'ayta iz awainaaa ilas sakhrati fa innii nasiitul huuta wa maaa ansaaniihu illash Shaitaanu an azkurah; wattakhaza sabiilahuu fil bahri'ajabaa",
    "arabic_meaning" : "Dia (pembantunya) menjawab, \"Tahukah engkau ketika kita mencari tempat berlindung di batu tadi, maka aku lupa (menceritakan tentang) ikan itu dan tidak ada yang membuat aku lupa untuk mengingatnya kecuali setan, dan (ikan) itu mengambil jalannya ke laut dengan cara yang aneh sekali.\""
  },
  {"arabic" : "قَالَ ذٰ لِكَ مَا كُنَّا نَبۡغِ ‌‌ۖ فَارۡتَدَّا عَلٰٓى اٰثَارِهِمَا قَصَصًا",
    "latin" : "Qoola zaalika maa kunnaa nabgh; fartaddaa 'alaa aasaari him maa qasasaa",
    "arabic_meaning" : "Dia (Musa) berkata, \"Itulah (tempat) yang kita cari.\" Lalu keduanya kembali, mengikuti jejak mereka semula."
  },
  {"arabic" : "فَوَجَدَا عَبۡدًا مِّنۡ عِبَادِنَاۤ اٰتَيۡنٰهُ رَحۡمَةً مِّنۡ عِنۡدِنَا وَعَلَّمۡنٰهُ مِنۡ لَّدُنَّا عِلۡمًا",
    "latin" : "Fa wajadaa 'abdam min 'ibaadinaaa aatainaahu Rahmatam min 'indinaa wa 'allamnaahu mil ladunnaa 'ilmaa",
    "arabic_meaning" : "Lalu mereka berdua bertemu dengan seorang hamba di antara hamba-hamba Kami, yang telah Kami berikan rahmat kepadanya dari sisi Kami, dan yang telah Kami ajarkan ilmu kepadanya dari sisi Kami."
  },
  {"arabic" : "قَالَ لَهٗ مُوۡسٰى هَلۡ اَتَّبِعُكَ عَلٰٓى اَنۡ تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدًا",
    "latin" : "Qoola lahuu Muusaa hal attabi'uka 'alaaa an tu'allimani mimmaa 'ullimta rushdaa",
    "arabic_meaning" : "Musa berkata kepadanya, \"Bolehkah aku mengikutimu agar engkau mengajarkan kepadaku (ilmu yang benar) yang telah diajarkan kepadamu (untuk menjadi) petunjuk?\""
  },
  {"arabic" : "قَالَ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ مَعِىَ صَبۡرًا",
    "latin" : "Qoolaa innaka lan tastatii'a ma'iya sabraa",
    "arabic_meaning" : "Dia menjawab, \"Sungguh, engkau tidak akan sanggup sabar bersamaku."
  },
  {"arabic" : "وَكَيۡفَ تَصۡبِرُ عَلٰى مَا لَمۡ تُحِطۡ بِهٖ خُبۡرًا",
    "latin" : "Wa kaifa tasbiru 'alaa maa lam tuhit bihii khubraa",
    "arabic_meaning" : "Dan bagaimana engkau akan dapat bersabar atas sesuatu, sedang engkau belum mempunyai pengetahuan yang cukup tentang hal itu?\""
  },
  {"arabic" : "قَالَ سَتَجِدُنِىۡۤ اِنۡ شَآءَ اللّٰهُ صَابِرًا وَّلَاۤ اَعۡصِىۡ لَكَ اَمۡرًا",
    "latin" : "Qoola satajiduniii in shaa 'al laahu saabiranw wa laaa a'sii laka amraa",
    "arabic_meaning" : "Dia (Musa) berkata, \"Insya Allah akan engkau dapati aku orang yang sabar, dan aku tidak akan menentangmu dalam urusan apa pun.\""
  },
  {"arabic" : "قَالَ فَاِنِ اتَّبَعۡتَنِىۡ فَلَا تَسۡـَٔـلۡنِىۡ عَنۡ شَىۡءٍ حَتّٰٓى اُحۡدِثَ لَـكَ مِنۡهُ ذِكۡرًا",
    "latin" : "Qoola fa init taba'tanii falaa tas'alnii 'an shai'in hattaaa uhdisa laka minhu zikraa",
    "arabic_meaning" : "Dia berkata, \"Jika engkau mengikutiku, maka janganlah engkau menanyakan kepadaku tentang sesuatu apa pun, sampai aku menerangkannya kepadamu.\""
  },
  {"arabic" : "فَانْطَلَقَا حَتّٰۤى اِذَا رَكِبَا فِى السَّفِيۡنَةِ خَرَقَهَا‌ ؕ قَالَ اَخَرَقۡتَهَا لِتُغۡرِقَ اَهۡلَهَا‌ ۚ لَقَدۡ جِئۡتَ شَيۡــًٔـا اِمۡرًا",
    "latin" : "Fantalaqoo hattaaa izaa rakibaa fis safiinati kharaqahaa qoola akharaqtahaa litughriqa ahlahaa laqad ji'ta shai'an imraa",
    "arabic_meaning" : "Maka berjalanlah keduanya, hingga ketika keduanya menaiki perahu lalu dia melubanginya. Dia (Musa) berkata, \"Mengapa engkau melubangi perahu itu, apakah untuk menenggelamkan penumpangnya?\" Sungguh, engkau telah berbuat suatu kesalahan yang besar."
  },
  {"arabic" : "قَالَ اَلَمۡ اَقُلۡ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ مَعِىَ صَبۡرًا",
    "latin" : "Qoola alam aqul innaka lan tastatii'a ma'iya sabraa",
    "arabic_meaning" : "Dia berkata, \"Bukankah sudah aku katakan, bahwa sesungguhnya engkau tidak akan mampu sabar bersamaku?\""
  },
  {"arabic" : "قَالَ لَا تُؤَاخِذۡنِىۡ بِمَا نَسِيۡتُ وَلَا تُرۡهِقۡنِىۡ مِنۡ اَمۡرِىۡ عُسۡرًا",
    "latin" : "Qoola laa tu'aakhiznii bimaa nasiitu wa laa turhiqnii min amrii 'usraa",
    "arabic_meaning" : "Dia (Musa) berkata, \"Janganlah engkau menghukum aku karena kelupaanku dan janganlah engkau membebani aku dengan suatu kesulitan dalam urusanku.\""
  },
  {"arabic" : "فَانْطَلَقَا حَتّٰۤى اِذَا لَقِيَا غُلٰمًا فَقَتَلَهٗ ۙ قَالَ اَقَتَلۡتَ نَـفۡسًا زَكِيَّةً ۢ بِغَيۡرِ نَـفۡسٍ ؕ لَـقَدۡ جِئۡتَ شَيۡــًٔـا نُّـكۡرًا",
    "latin" : "Fantalaqoo hattaa izaa laqiyaa ghulaaman faqatalahuu qoola aqatalta nafsan zakiy yatam bighairi nafs; laqad ji'ta shai'an nukraa",
    "arabic_meaning" : "Maka berjalanlah keduanya; hingga ketika keduanya berjumpa dengan seorang anak muda, maka dia membunuhnya. Dia (Musa) berkata, \"Mengapa engkau bunuh jiwa yang bersih, bukan karena dia membunuh orang lain? Sungguh, engkau telah melakukan sesuatu yang sangat mungkar.\""
  },
  {"arabic" : "قَالَ اَ لَمۡ اَ قُلْ لَّكَ اِنَّكَ لَنۡ تَسۡتَطِيۡعَ مَعِىَ صَبۡرًا",
    "latin" : "Qoola alam aqul laka innaka lan tastatii'a ma'iya sabraa",
    "arabic_meaning" : "Dia berkata, \"Bukankah sudah kukatakan kepadamu, bahwa engkau tidak akan mampu sabar bersamaku?\""
  },
  {"arabic" : "قَالَ اِنۡ سَاَ لۡـتُكَ عَنۡ شَىۡءٍۢ بَعۡدَهَا فَلَا تُصٰحِبۡنِىۡ‌ ۚ قَدۡ بَلَـغۡتَ مِنۡ لَّدُنِّىۡ عُذۡرًا",
    "latin" : "Qoola in sa altuka 'an shai'im ba'dahaa falaa tusaahibnii qad balaghta mil ladunnii 'uzraa",
    "arabic_meaning" : "Dia (Musa) berkata, \"Jika aku bertanya kepadamu tentang sesuatu setelah ini, maka jangan lagi engkau memperbolehkan aku menyertaimu, sesungguhnya engkau sudah cukup (bersabar) menerima alasan dariku.\""
  },
  {"arabic" : "فَانْطَلَقَا حَتّٰۤى اِذَاۤ اَتَيَاۤ اَهۡلَ قَرۡيَةِ  ۨاسۡتَطۡعَمَاۤ اَهۡلَهَا فَاَبَوۡا اَنۡ يُّضَيِّفُوۡهُمَا فَوَجَدَا فِيۡهَا جِدَارًا يُّرِيۡدُ اَنۡ يَّـنۡقَضَّ فَاَقَامَهٗ‌ ؕ قَالَ لَوۡ شِئۡتَ لَـتَّخَذۡتَ عَلَيۡهِ اَجۡرًا",
    "latin" : "Fantalaqoo hattaaa izaaa atayaaa ahla qaryatinis tat'amaaa ahlahaa fa abaw any yudaiyifuuhumaa fawajadaa fiihaa jidaarany yuriidu any yanqadda fa aqoomah; qoola law shi'ta lattakhazta 'alaihi ajraa",
    "arabic_meaning" : "Maka keduanya berjalan; hingga ketika keduanya sampai kepada penduduk suatu negeri, mereka berdua meminta dijamu oleh penduduknya, tetapi mereka (penduduk negeri itu) tidak mau menjamu mereka, kemudian keduanya mendapatkan dinding rumah yang hampir roboh (di negeri itu), lalu dia menegakkannya. Dia (Musa) berkata, \"Jika engkau mau, niscaya engkau dapat meminta imbalan untuk itu.\""
  },
  {"arabic" : "قَالَ هٰذَا فِرَاقُ بَيۡنِىۡ وَبَيۡنِكَ‌‌ ۚ سَاُنَـبِّئُكَ بِتَاۡوِيۡلِ مَا لَمۡ تَسۡتَطِعْ عَّلَيۡهِ صَبۡرًا",
    "latin" : "Qoola haazaa firaaqu bainii wa bainik; sa unabi 'uka bitaawiili maa lam tastati' 'alaihi sabraa",
    "arabic_meaning" : "Dia berkata, \"Inilah perpisahan antara aku dengan engkau; aku akan memberikan penjelasan kepadamu atas perbuatan yang engkau tidak mampu sabar terhadapnya."
  },
  {"arabic" : "اَمَّا السَّفِيۡنَةُ فَكَانَتۡ لِمَسٰكِيۡنَ يَعۡمَلُوۡنَ فِى الۡبَحۡرِ فَاَرَدْتُّ اَنۡ اَعِيۡبَهَا وَكَانَ وَرَآءَهُمۡ مَّلِكٌ يَّاۡخُذُ كُلَّ سَفِيۡنَةٍ غَصۡبًا",
    "latin" : "Ammas safiinatu fakaanat limasaakiina ya'maluuna fil bahri fa arattu an a'iibahaa wa kaana waraaa' ahum malikuny yaakhuzu kulla safiinatin ghasbaa",
    "arabic_meaning" : "Adapun perahu itu adalah milik orang miskin yang bekerja di laut; aku bermaksud merusaknya, karena di hadapan mereka ada seorang raja yang akan merampas setiap perahu."
  },
  {"arabic" : "وَاَمَّا الۡغُلٰمُ فَكَانَ اَبَوٰهُ مُؤۡمِنَيۡنِ فَخَشِيۡنَاۤ اَنۡ يُّرۡهِقَهُمَا طُغۡيَانًا وَّكُفۡرًا‌ۚ",
    "latin" : "Wa aammal ghulaamu fakaana abawaahu mu'minaini fakhashiinaaa any yurhiqa humaa tughyaananw wa kufraa",
    "arabic_meaning" : "Dan adapun anak muda (kafir) itu, kedua orang tuanya mukmin, dan kami khawatir kalau dia akan memaksa kedua orang tuanya kepada kesesatan dan kekafiran."
  },
  {"arabic" : "فَاَرَدۡنَاۤ اَنۡ يُّبۡدِلَهُمَا رَبُّهُمَا خَيۡرًا مِّنۡهُ زَكٰوةً وَّاَقۡرَبَ رُحۡمًا",
    "latin" : "Faradnaa any yubdila humaa Rabbuhumaa khairam minhu zakaatanw wa aqraba ruhmaa",
    "arabic_meaning" : "Kemudian kami menghendaki, sekiranya Tuhan mereka menggantinya dengan (seorang anak) lain yang lebih baik kesuciannya daripada (anak) itu dan lebih sayang (kepada ibu bapaknya)."
  },
  {"arabic" : "وَاَمَّا الۡجِدَارُ فَكَانَ لِغُلٰمَيۡنِ يَتِيۡمَيۡنِ فِى الۡمَدِيۡنَةِ وَكَانَ تَحۡتَهٗ كَنۡزٌ لَّهُمَا وَكَانَ اَبُوۡهُمَا صَالِحًـا ۚ فَاَرَادَ رَبُّكَ اَنۡ يَّبۡلُغَاۤ اَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنۡزَهُمَا ۖ رَحۡمَةً مِّنۡ رَّبِّكَ‌‌ ۚ وَمَا فَعَلۡتُهٗ عَنۡ اَمۡرِىۡ‌ ؕ ذٰ لِكَ تَاۡوِيۡلُ مَا لَمۡ تَسۡطِعْ عَّلَيۡهِ صَبۡرًا",
    "latin" : "Wa ammal jidaaru fakaana lighulaamaini yatiimaini fil madiinati wa kaana tahtahuu kanzul lahumaa wa kaana abuuhumaa saalihan fa araada Rabbuka any yablughaaa ashuddahumaa wa yastakhrijaa kanzahumaa rahmatam mir Rabbik; wa maa fa'altuhuu 'an amrii; zaalika",
    "arabic_meaning" : "Dan adapun dinding rumah itu adalah milik dua anak yatim di kota itu, yang di bawahnya tersimpan harta bagi mereka berdua, dan ayahnya seorang yang shalih. Maka Tuhanmu menghendaki agar keduanya sampai dewasa dan keduanya mengeluarkan simpanannya itu sebagai rahmat dari Tuhanmu. Apa yang kuperbuat bukan menurut kemauanku sendiri. Itulah keterangan perbuatan-perbuatan yang engkau tidak sabar terhadapnya.\""
  },
  {"arabic" : "وَيَسۡـــَٔلُوۡنَكَ عَنۡ ذِى الۡقَرۡنَيۡنِ‌ ؕ قُلۡ سَاَ تۡلُوۡا عَلَيۡكُمۡ مِّنۡهُ ذِكۡرًا",
    "latin" : "Wa yas'aluunaka 'an Zil Qarnaini qul sa atluu 'alaikum minhu zikraa",
    "arabic_meaning" : "Dan mereka bertanya kepadamu (Muhammad) tentang Zulkarnain. Katakanlah, \"Akan kubacakan kepadamu kisahnya.\""
  },
  {"arabic" : "اِنَّا مَكَّنَّا لَهٗ فِى الۡاَرۡضِ وَاٰتَيۡنٰهُ مِنۡ كُلِّ شَىۡءٍ سَبَبًا",
    "latin" : "Innaa makkannaa lahuu fil ardi wa aatainaahu min kulli shai'in sababaa",
    "arabic_meaning" : "Sungguh, Kami telah memberi kedudukan kepadanya di bumi, dan Kami telah memberikan jalan kepadanya (untuk mencapai) segala sesuatu"
  },
  {"arabic" : "فَاَ تۡبَعَ سَبَبًا",
    "latin" : "Fa atba'a sababaa",
    "arabic_meaning" : "maka dia pun menempuh suatu jalan."
  },
  {"arabic" : "حَتّٰٓى اِذَا بَلَغَ مَغۡرِبَ الشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِىۡ عَيۡنٍ حَمِئَةٍ وَّوَجَدَ عِنۡدَهَا قَوۡمًا ؕ ‌قُلۡنَا يٰذَا الۡقَرۡنَيۡنِ اِمَّاۤ اَنۡ تُعَذِّبَ وَاِمَّاۤ اَنۡ تَتَّخِذَ فِيۡهِمۡ حُسۡنًا",
    "latin" : "Hattaaa izaa balagha maghribash shamsi wajadahaaa taghrubu fii 'aynin hami'a tinw wa wajada 'indahaa qawmaa; qulnaa yaa Zal Qarnaini immaaa an tu'az ziba wa immaaa an tattakhiza fiihim husnaa",
    "arabic_meaning" : "Hingga ketika dia telah sampai di tempat matahari terbenam, dia melihatnya (matahari) terbenam di dalam laut yang berlumpur hitam, dan di sana ditemukannya suatu kaum (tidak beragama). Kami berfirman, \"Wahai Zulkarnain! Engkau boleh menghukum atau berbuat kebaikan (mengajak beriman) kepada mereka.\""
  },
  {"arabic" : "قَالَ اَمَّا مَنۡ ظَلَمَ فَسَوۡفَ نُعَذِّبُهٗ ثُمَّ يُرَدُّ اِلٰى رَبِّهٖ فَيُعَذِّبُهٗ عَذَابًا نُّكۡرًا",
    "latin" : "Qoola amaa man zalama fasawfa nu'azzibuhuu summa yuraddu ilaa Rabbihii fa yu 'azzibuhuu azaaban nukraa",
    "arabic_meaning" : "Dia (Zulkarnain) berkata, \"Barangsiapa berbuat zhalim, kami akan menghukumnya, lalu dia akan dikembalikan kepada Tuhannya, kemudian Tuhan mengazabnya dengan azab yang sangat keras."
  },
  {"arabic" : "وَاَمَّا مَنۡ اٰمَنَ وَعَمِلَ صَالِحًـا فَلَهٗ جَزَآءَ ۨالۡحُسۡنٰى‌ ۚ وَسَنَقُوۡلُ لَهٗ مِنۡ اَمۡرِنَا يُسۡرًا",
    "latin" : "Wa ammaa man aamana wa 'amila saalihan falahuu jazaaa'anil husnaa wa sanaquulu lahuu min amrinaa yusraa",
    "arabic_meaning" : "Adapun orang yang beriman dan mengerjakan kebajikan, maka dia mendapat (pahala) yang terbaik sebagai balasan, dan akan kami sampaikan kepadanya perintah kami yang mudah-mudah.\""
  },
  {"arabic" : "ثُمَّ اَتۡبَعَ سَبَبًا",
    "latin" : "Summa atba'a sababaa",
    "arabic_meaning" : "Kemudian dia menempuh suatu jalan (yang lain)."
  },
  {"arabic" : "حَتّٰٓى اِذَابَلَغَ مَطۡلِعَ الشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلٰى قَوۡمٍ لَّمۡ نَجۡعَلْ لَّهُمۡ مِّنۡ دُوۡنِهَا سِتۡرًا ۙ",
    "latin" : "Hattaaa izaa balagha matli'ash shamsi wajdahaa tatlu'u alaa qawmil lam naj'al lahum min duunihaa sitraa",
    "arabic_meaning" : "Hingga ketika dia sampai di tempat terbit matahari (sebelah timur) didapatinya (matahari) bersinar di atas suatu kaum yang tidak Kami buatkan suatu pelindung bagi mereka dari (cahaya matahari) itu"
  },
  {"arabic" : "كَذٰلِكَؕ وَقَدۡ اَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرًا",
    "latin" : "Kazaalika wa qad ahatnaa bimaa ladaihi khubraa",
    "arabic_meaning" : "demikianlah, dan sesungguhnya Kami mengetahui segala sesuatu yang ada padanya (Zulkarnain)."
  },
  {"arabic" : "ثُمَّ اَتۡبَعَ سَبَبًا",
    "latin" : "Summa atba'a sababaa",
    "arabic_meaning" : "Kemudian dia menempuh suatu jalan (yang lain lagi)."
  },
  {"arabic" : "حَتّٰٓى اِذَا بَلَغَ بَيۡنَ السَّدَّيۡنِ وَجَدَ مِنۡ دُوۡنِهِمَا قَوۡمًا ۙ لَّا يَكَادُوۡنَ يَفۡقَهُوۡنَ قَوۡلًا",
    "latin" : "Hattaaa izaa balagha bainas saddaini wajada min duunihimaa qawmal laa yakaa duuna yafqahuuna qawlaa",
    "arabic_meaning" : "Hingga ketika dia sampai di antara dua gunung, didapatinya di belakang (kedua gunung itu) suatu kaum yang hampir tidak memahami pembicaraan."
  },
  {"arabic" : "قَالُوۡا يٰذَا الۡقَرۡنَيۡنِ اِنَّ يَاۡجُوۡجَ وَمَاۡجُوۡجَ مُفۡسِدُوۡنَ فِى الۡاَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلٰٓى اَنۡ تَجۡعَلَ بَيۡنَـنَا وَبَيۡنَهُمۡ سَدًّا",
    "latin" : "Qooluu yaa Zal qarnaini inna Yaajuuja wa Maajuuja mufsiduuna fil ardi fahal naj'alu laka kharjan 'alaaa an taj'ala bainanaa wa bainahum saddas",
    "arabic_meaning" : "Mereka berkata, \"Wahai Zulkarnain! Sungguh, Yakjuj dan Makjuj itu (makhluk yang) berbuat kerusakan di bumi, maka bolehkah kami membayarmu imbalan agar engkau membuatkan dinding penghalang antara kami dan mereka?\""
  },
  {"arabic" : "قَالَ مَا مَكَّنِّىۡ فِيۡهِ رَبِّىۡ خَيۡرٌ فَاَعِيۡنُوۡنِىۡ بِقُوَّةٍ اَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا",
    "latin" : "Qoola maa makkannii fiihi Rabbii khairun fa-a'iinuunii biquwwatin aj'al bainakum wa bainahum radmaa",
    "arabic_meaning" : "Dia (Zulkarnain) berkata, \"Apa yang telah dianugerahkan Tuhan kepadaku lebih baik (daripada imbalanmu), maka bantulah aku dengan kekuatan, agar aku dapat membuatkan dinding penghalang antara kamu dan mereka."
  },
  {"arabic" : "اٰتُوۡنِىۡ زُبَرَ الۡحَدِيۡدِ‌ ؕ حَتّٰٓى اِذَا سَاوٰى بَيۡنَ الصَّدَفَيۡنِ قَالَ انْـفُخُوۡا‌ ؕ حَتّٰٓى اِذَا جَعَلَهٗ نَارًا ۙ قَالَ اٰتُوۡنِىۡۤ اُفۡرِغۡ عَلَيۡهِ قِطۡرًا ؕ",
    "latin" : "Aatuunii zubaral hadiid, hattaaa izaa saawaa bainas sadafaini qoolan fukhuu hattaaa izaa ja'alahuu naaran qoola aatuuniii ufrigh 'alaihi qitraa",
    "arabic_meaning" : "Berilah aku potongan-potongan besi!\" Hingga ketika (potongan) besi itu telah (terpasang) sama rata dengan kedua (puncak) gunung itu, dia (Zulkarnain) berkata, \"Tiuplah (api itu)!\" Ketika (besi) itu sudah menjadi (merah seperti) api, dia pun berkata, \"Berilah aku tembaga (yang mendidih) agar kutuangkan ke atasnya (besi panas itu).\""
  },
  {"arabic" : "فَمَا اسۡطَاعُوۡۤا اَنۡ يَّظۡهَرُوۡهُ وَمَا اسۡتَطَاعُوۡا لَهٗ نَـقۡبًا",
    "latin" : "Famas taa'uuu any yazharuuhu wa mastataa'uu lahuu naqbaa",
    "arabic_meaning" : "Maka mereka (Yakjuj dan Makjuj) tidak dapat mendakinya dan tidak dapat (pula) melubanginya."
  },
  {"arabic" : "قَالَ هٰذَا رَحۡمَةٌ مِّنۡ رَّبِّىۡ‌ ۚ فَاِذَا جَآءَ وَعۡدُ رَبِّىۡ جَعَلَهٗ دَكَّآءَ‌ ۚ وَكَانَ وَعۡدُ رَبِّىۡ حَقًّا ؕ",
    "latin" : "Qoola haaza rahmatummir Rabbii fa izaa jaaa'a wa'du Rabbii ja'alahuu dakkaaa'a; wa kaana; wa du Rabbii haqqoo",
    "arabic_meaning" : "Dia (Zulkarnain) berkata, \"(Dinding) ini adalah rahmat dari Tuhanku, maka apabila janji Tuhanku sudah datang, Dia akan menghancurluluhkannya; dan janji Tuhanku itu benar.\""
  },
  {"arabic" : "وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَٮِٕذٍ يَّمُوۡجُ فِىۡ بَعۡضٍ‌ وَّنُفِخَ فِى الصُّوۡرِ فَجَمَعۡنٰهُمۡ جَمۡعًا",
    "latin" : "Wa taraknaa ba'dahum Yawma'iziny yamuuju fii ba'dinw wa nufikha fis Suuri fajama'naahum jam'aa",
    "arabic_meaning" : "Dan pada hari itu Kami biarkan mereka (Yakjuj dan Makjuj) berbaur antara satu dengan yang lain, dan (apa-bila) sangkakala ditiup (lagi), akan Kami kumpulkan mereka semuanya."
  },
  {"arabic" : "وَّعَرَضۡنَا جَهَـنَّمَ يَوۡمَٮِٕذٍ لِّـلۡكٰفِرِيۡنَ عَرۡضَا ۙ",
    "latin" : "Wa 'aradnaa jahannama Yawma'izil lilkaafiriina 'ardaa",
    "arabic_meaning" : "Dan Kami perlihatkan (neraka) Jahanam dengan jelas pada hari itu kepada orang kafir"
  },
  {"arabic" : "اۨلَّذِيۡنَ كَانَتۡ اَعۡيُنُهُمۡ فِىۡ غِطَآءٍ عَنۡ ذِكۡرِىۡ وَكَانُوۡا لَا يَسۡتَطِيۡعُوۡنَ سَمۡعًا",
    "latin" : "Allaziina kaanat a'yunuhum fii ghitaaa'in 'an zikrii wa kaanuu la yastatii'uuna sam'aa",
    "arabic_meaning" : "(yaitu) orang yang mata (hati)nya dalam keadaan tertutup (tidak mampu) dari memperhatikan tanda-tanda (kebesaran)-Ku, dan mereka tidak sanggup mendengar."
  },
  {"arabic" : "اَفَحَسِبَ الَّذِيۡنَ كَفَرُوۡۤا اَنۡ يَّتَّخِذُوۡا عِبَادِىۡ مِنۡ دُوۡنِىۡۤ اَوۡلِيَآءَ‌ ؕ اِنَّاۤ اَعۡتَدۡنَا جَهَـنَّمَ لِلۡكٰفِرِيۡنَ نُزُلًا",
    "latin" : "Afahasibal laziina kafaruuu any yattakhizuu 'ibaadii min duuniii awliyaaa'; innaaa a'tadnaa jahannama lilkaafi riina nuzulaa",
    "arabic_meaning" : "Maka apakah orang kafir menyangka bahwa mereka (dapat) mengambil hamba-hamba-Ku menjadi penolong selain Aku? Sungguh, Kami telah menyediakan (neraka) Jahanam sebagai tempat tinggal bagi orang-orang kafir."
  },
  {"arabic" : "قُلۡ هَلۡ نُـنَبِّئُكُمۡ بِالۡاَخۡسَرِيۡنَ اَعۡمَالًا",
    "latin" : "Qul hal nunabbi'ukum bilakhsariina a'maalaa",
    "arabic_meaning" : "Katakanlah (Muhammad), \"Apakah perlu Kami beritahukan kepadamu tentang orang yang paling rugi perbuatannya?\""
  },
  {"arabic" : "اَ لَّذِيۡنَ ضَلَّ سَعۡيُهُمۡ فِى الۡحَيٰوةِ الدُّنۡيَا وَهُمۡ يَحۡسَبُوۡنَ اَنَّهُمۡ يُحۡسِنُوۡنَ صُنۡعًا",
    "latin" : "Allaziina dalla sa'yuhum fil hayaatid dunyaa wa hum yahsabuuna annahum yuhsinuuna sun'aa",
    "arabic_meaning" : "(Yaitu) orang yang sia-sia perbuatannya dalam kehidupan dunia, sedangkan mereka mengira telah berbuat sebaik-baiknya."
  },
  {"arabic" : "اُولٰۤٮِٕكَ الَّذِيۡنَ كَفَرُوۡا بِاٰيٰتِ رَبِّهِمۡ وَلِقَآٮِٕهٖ فَحَبِطَتۡ اَعۡمَالُهُمۡ فَلَا نُقِيۡمُ لَهُمۡ يَوۡمَ الۡقِيٰمَةِ وَزۡنًـا",
    "latin" : "Ulaaa'ikal laziina kafaruu bi aayaati Rabbihim wa liqooa'ihii fahabitat a'maaluhum falaa nuqiimu lahum Yawmal Qiyaamati waznaa",
    "arabic_meaning" : "Mereka itu adalah orang yang mengingkari ayat-ayat Tuhan mereka dan (tidak percaya) terhadap pertemuan dengan-Nya. Maka sia-sia amal mereka, dan Kami tidak memberikan penimbangan terhadap (amal) mereka pada hari Kiamat."
  },
  {"arabic" : "ذٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُوۡا وَاتَّخَذُوۡۤا اٰيٰتِىۡ وَرُسُلِىۡ هُزُوًا",
    "latin" : "Zaalika jazaaa'uhum jahannamu bimaa kafaruu wattakhazuuu Aayaatii wa Rusulii huzuwaa",
    "arabic_meaning" : "Demikianlah, balasan mereka itu neraka Jahanam, karena kekafiran mereka, dan karena mereka menjadikan ayat-ayat-Ku dan rasul-rasul-Ku sebagai bahan olok-olok."
  },
  {"arabic" : "اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ كَانَتۡ لَهُمۡ جَنّٰتُ الۡفِرۡدَوۡسِ نُزُلًا ۙ",
    "latin" : "Innal laziina aamanuu wa 'amilus saalihaati kaanat lahum Jannaatul Firdawsi nuzulaa",
    "arabic_meaning" : "Sungguh, orang yang beriman dan mengerjakan kebajikan, untuk mereka disediakan surga Firdaus sebagai tempat tinggal"
  },
  {"arabic" : "خٰلِدِيۡنَ فِيۡهَا لَا يَـبۡغُوۡنَ عَنۡهَا حِوَلًا",
    "latin" : "Khaalidiina fiiha la yabghuuna 'anhaa hiwalaa",
    "arabic_meaning" : "mereka kekal di dalamnya, mereka tidak ingin pindah dari sana."
  },
  {"arabic" : "قُلْ لَّوۡ كَانَ الۡبَحۡرُ مِدَادًا لِّـكَلِمٰتِ رَبِّىۡ لَـنَفِدَ الۡبَحۡرُ قَبۡلَ اَنۡ تَـنۡفَدَ كَلِمٰتُ رَبِّىۡ وَلَوۡ جِئۡنَا بِمِثۡلِهٖ مَدَدًا",
    "latin" : "Qul law kaanal bahru midaadal lik Kalimaati Rabbii lanafidal bahru qabla an tanfada Kalimaatu Rabbii wa law ji'naa bimislihii madadaa",
    "arabic_meaning" : "Katakanlah (Muhammad), \"Seandainya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku, maka pasti habislah lautan itu sebelum selesai (penulisan) kalimat-kalimat Tuhanku, meskipun Kami datangkan tambahan sebanyak itu (pula).\""
  },
  {
    "arabic": "قُلۡ اِنَّمَاۤ اَنَا بَشَرٌ مِّثۡلُكُمۡ يُوۡحٰٓى اِلَىَّ اَنَّمَاۤ اِلٰهُكُمۡ اِلٰـهٌ وَّاحِدٌ‌  ۚ فَمَنۡ كَانَ يَرۡجُوۡالِقَآءَ رَبِّهٖ فَلۡيَـعۡمَلۡ عَمَلًا صَالِحًـاوَّلَايُشۡرِكۡ بِعِبَادَةِ رَبِّهٖۤ اَحَدًا",
    "latin": "Qul innamaaa ana basharum mislukum yuuhaaa ilaiya annamaa ilaahukum Ilaahunw Waahid; faman kaana yarjuu liqooa'a Rabbihii falya'mal 'amalan saalihanw wa laa yushrik bi'ibaadati Rabbihiii ahadaa",
    "arabic_meaning": "Katakanlah (Muhammad), \"Sesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah menerima wahyu, bahwa sesungguhnya Tuhan kamu adalah Tuhan Yang Maha Esa.\" Maka barangsiapa mengharap pertemuan dengan Tuhannya maka hendaklah dia mengerjakan kebajikan dan janganlah dia mempersekutukan dengan sesuatu pun dalam beribadah kepada Tuhannya.\""
  }
]